* Set org-file apps
Override settings (that use chrome directly) in =ethanligon.org=.
#+BEGIN_SRC emacs-lisp
(setq org-file-apps
    (quote
    ((auto-mode . emacs)
     ("\\.mm\\'" . default)
     ("\\.x?html?\\'" . "garcon-url-handler %s")
     ("\\.pdf\\'" . "garcon-url-handler %s"))))
#+END_SRC

#+results:
: ((auto-mode . emacs) (\.mm\' . default) (\.x?html?\' . garcon-url-handler %s) (\.pdf\' . garcon-url-handler %s))
